app/Livewire/Forms/CreateCustomer.php

    public function save(): void
    {
        $this->validate();

        Customer::create([
            'first_name' => $this->firstName,
            'last_name' => $this->lastName,
            'email_primary' => $this->emailPrimary,
            'email_invoice' => $this->emailInvoice,
            'street_address' => $this->streetAddress,
            'city' => $this->city,
            'state' => $this->state,
            'zip' => $this->zip,
            'phone_primary' => $this->phonePrimary,
            'notes' => $this->notes,
        ]);
---
insert into `customers` (`first_name`, `last_name`, `email_primary`, `email_invoice`, `street_address`, `city`, `state`, `zip`, `phone_primary`, `notes`, `updated_at`, `created_at`) values ('Jake', 'Smithers', 'jake@smithers.com', 'jake@somethingelse.com', '', 'Toronto', 'Michigan', '83929', '(323)131-9239', 'Here are somenotes', '2024-04-23 19:41:22', '2024-04-23 19:41:22')