app/Livewire/Pages/Customers/CustomerList.php

    public function customers()
    {
        if ($this->search === '') {
            return Customer::query()->orderBy('id', 'desc')->paginate(20);
---
select * from `customers` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `customers`

    public function delete($customerId)
    {
        // Should Authorize! But I need to get this out.
        $customer = Customer::find($customerId);

        $customer->delete();
---
select * from `customers` where `customers`.`id` = 308 limit 1
delete from `customers` where `id` = 308